GhostBeamFX/makerfabs-dwm3000-esp32-lib/DWM3000/src/dwm3000_regs.h
/******************************************************************************
* @brief Bit definitions for register DMA_CFG1
**/
#define DMA_CFG1_ID                          0x10048
#define DMA_CFG1_LEN                         (4U)
#define DMA_CFG1_MASK                        0xFFFFFFFFUL
#define DMA_CFG1_PYLD_SIZE_BIT_OFFSET    (7U)
#define DMA_CFG1_PYLD_SIZE_BIT_LEN       (10U)
#define DMA_CFG1_PYLD_SIZE_BIT_MASK      0x1ff80UL
#define DMA_CFG1_HDR_SIZE_BIT_OFFSET     (0U)
#define DMA_CFG1_HDR_SIZE_BIT_LEN        (7U)
#define DMA_CFG1_HDR_SIZE_BIT_MASK       0x7fU

/******************************************************************************
* @brief Bit definitions for register AES_START
**/
#define AES_START_ID                         0x1004c
#define AES_START_LEN                        (4U)
#define AES_START_MASK                       0xFFFFFFFFUL
#define AES_START_AES_START_BIT_OFFSET       (0U)
#define AES_START_AES_START_BIT_LEN          (1U)
#define AES_START_AES_START_BIT_MASK         0x1U

/******************************************************************************
* @brief Bit definitions for register AES_STS
**/
#define AES_STS_ID                           0x10050
#define AES_STS_LEN                          (4U)
#define AES_STS_MASK                         0xFFFFFFFFUL
#define AES_STS_RAM_FULL_BIT_OFFSET          (5U)
#define AES_STS_RAM_FULL_BIT_LEN             (1U)
#define AES_STS_RAM_FULL_BIT_MASK            0x20U
#define AES_STS_RAM_EMPTY_BIT_OFFSET         (4U)
#define AES_STS_RAM_EMPTY_BIT_LEN            (1U)
#define AES_STS_RAM_EMPTY_BIT_MASK           0x10U
#define AES_STS_MEM_CONF_BIT_OFFSET          (3U)
#define AES_STS_MEM_CONF_BIT_LEN             (1U)
#define AES_STS_MEM_CONF_BIT_MASK            0x8U
#define AES_STS_TRANS_ERR_BIT_OFFSET         (2U)
#define AES_STS_TRANS_ERR_BIT_LEN            (1U)
#define AES_STS_TRANS_ERR_BIT_MASK           0x4U
#define AES_STS_AUTH_ERR_BIT_OFFSET          (1U)
#define AES_STS_AUTH_ERR_BIT_LEN             (1U)
#define AES_STS_AUTH_ERR_BIT_MASK            0x2U
#define AES_STS_AES_DONE_BIT_OFFSET          (0U)
#define AES_STS_AES_DONE_BIT_LEN             (1U)
#define AES_STS_AES_DONE_BIT_MASK            0x1U

/******************************************************************************
* @brief Bit definitions for register AES_KEY0
**/
#define AES_KEY0_ID                          0x10054
#define AES_KEY0_LEN                         (4U)
#define AES_KEY0_MASK                        0xFFFFFFFFUL

/******************************************************************************
* @brief Bit definitions for register AES_KEY1
**/
#define AES_KEY1_ID                          0x10058
#define AES_KEY1_LEN                         (4U)
#define AES_KEY1_MASK                        0xFFFFFFFFUL

/******************************************************************************
* @brief Bit definitions for register AES_KEY2
**/
#define AES_KEY2_ID                          0x1005c
#define AES_KEY2_LEN                         (4U)
#define AES_KEY2_MASK                        0xFFFFFFFFUL

/******************************************************************************
* @brief Bit definitions for register AES_KEY3
**/
#define AES_KEY3_ID                          0x10060
#define AES_KEY3_LEN                         (4U)
#define AES_KEY3_MASK                        0xFFFFFFFFUL

/******************************************************************************
* @brief Bit definitions for register STS_CFG0
**/
#define STS_CFG0_ID                           0x20000
#define STS_CFG0_LEN                          (4U)
#define STS_CFG0_MASK                         0xFFFFFFFFUL
#define STS_CFG0_CPS_LEN_BIT_OFFSET         (0U)
#define STS_CFG0_CPS_LEN_BIT_LEN            (8U)
#define STS_CFG0_CPS_LEN_BIT_MASK           0xffU

/******************************************************************************
* @brief Bit definitions for register STS_CTRL
**/
#define STS_CTRL_ID                           0x20004
#define STS_CTRL_LEN                          (4U)
#define STS_CTRL_MASK                         0xFFFFFFFFUL
#define STS_CTRL_RST_LAST_BIT_OFFSET (1U)
#define STS_CTRL_RST_LAST_BIT_LEN (1U)
#define STS_CTRL_RST_LAST_BIT_MASK 0x2U
#define STS_CTRL_LOAD_IV_BIT_OFFSET        (0U)
#define STS_CTRL_LOAD_IV_BIT_LEN           (1U)
#define STS_CTRL_LOAD_IV_BIT_MASK          0x1U

/******************************************************************************
* @brief Bit definitions for register STS_STS
**/
#define STS_STS_ID                            0x20008
#define STS_STS_LEN                           (4U)
#define STS_STS_MASK                          0xFFFFFFFFUL
#define STS_STS_ACC_QUAL_BIT_OFFSET           (0U)
#define STS_STS_ACC_QUAL_BIT_LEN              (12U)
#define STS_STS_ACC_QUAL_BIT_MASK             0xfffU

/******************************************************************************
* @brief Bit definitions for register STS_KEY0
**/
#define STS_KEY0_ID                           0x2000c
#define STS_KEY0_LEN                          (4U)
#define STS_KEY0_MASK                         0xFFFFFFFFUL

/******************************************************************************
* @brief Bit definitions for register STS_KEY1
**/
#define STS_KEY1_ID                           0x20010
#define STS_KEY1_LEN                          (4U)
#define STS_KEY1_MASK                         0xFFFFFFFFUL

/******************************************************************************
* @brief Bit definitions for register STS_KEY2
**/
#define STS_KEY2_ID                           0x20014
#define STS_KEY2_LEN                          (4U)
#define STS_KEY2_MASK                         0xFFFFFFFFUL

/******************************************************************************
* @brief Bit definitions for register STS_KEY3
**/
#define STS_KEY3_ID                           0x20018
#define STS_KEY3_LEN                          (4U)
#define STS_KEY3_MASK                         0xFFFFFFFFUL

