GhostBeamFX/makerfabs-dwm3000-esp32-lib/DWM3000/src/dwm3000_regs.h
/******************************************************************************
* @brief Bit definitions for register STS_IV0
**/
#define STS_IV0_ID                            0x2001c
#define STS_IV0_LEN                           (4U)
#define STS_IV0_MASK                          0xFFFFFFFFUL

/******************************************************************************
* @brief Bit definitions for register STS_IV1
**/
#define STS_IV1_ID                            0x20020
#define STS_IV1_LEN                           (4U)
#define STS_IV1_MASK                          0xFFFFFFFFUL

/******************************************************************************
* @brief Bit definitions for register STS_IV2
**/
#define STS_IV2_ID                            0x20024
#define STS_IV2_LEN                           (4U)
#define STS_IV2_MASK                          0xFFFFFFFFUL

/******************************************************************************
* @brief Bit definitions for register STS_IV3
**/
#define STS_IV3_ID                            0x20028
#define STS_IV3_LEN                           (4U)
#define STS_IV3_MASK                          0xFFFFFFFFUL

/******************************************************************************
* @brief Bit definitions for register LCSS_MARGIN
**/
#define LCSS_MARGIN_ID                       0x20034

/******************************************************************************
* @brief Bit definitions for register DGC_CFG
**/
#define DGC_CFG_ID                           0x30018
#define DGC_CFG_LEN                          (4U)
#define DGC_CFG_MASK                         0xFFFFFFFFUL
#define DGC_CFG_THR_64_BIT_OFFSET            (9U)
#define DGC_CFG_THR_64_BIT_LEN               (6U)
#define DGC_CFG_THR_64_BIT_MASK              0x7e00U
#define DGC_CFG_RX_TUNE_EN_BIT_OFFSET        (0U)
#define DGC_CFG_RX_TUNE_EN_BIT_LEN           (1U)
#define DGC_CFG_RX_TUNE_EN_BIT_MASK          0x1U

/******************************************************************************
* @brief Bit definitions for register DGC_CFG0
**/
#define DGC_CFG0_ID              0x3001c
#define DGC_CFG0_LEN             (4U)
#define DGC_CFG0_MASK            0xFFFFFFFFUL

/******************************************************************************
* @brief Bit definitions for register DGC_CFG1
**/
#define DGC_CFG1_ID             0x30020
#define DGC_CFG1_LEN            (4U)
#define DGC_CFG1_MASK           0xFFFFFFFFUL

/******************************************************************************
* @brief Bit definitions for register DGC_LUT_0_CFG
**/
#define DGC_LUT_0_CFG_ID                 0x30038
#define DGC_LUT_0_CFG_LEN                (4U)
#define DGC_LUT_0_CFG_MASK               0xFFFFFFFFUL

/******************************************************************************
* @brief Bit definitions for register DGC_LUT_1_CFG
**/
#define DGC_LUT_1_CFG_ID                 0x3003c
#define DGC_LUT_1_CFG_LEN                (4U)
#define DGC_LUT_1_CFG_MASK               0xFFFFFFFFUL

/******************************************************************************
* @brief Bit definitions for register DGC_LUT_2_CFG
**/
#define DGC_LUT_2_CFG_ID                 0x30040
#define DGC_LUT_2_CFG_LEN                (4U)
#define DGC_LUT_2_CFG_MASK               0xFFFFFFFFUL

/******************************************************************************
* @brief Bit definitions for register DGC_LUT_3_CFG
**/
#define DGC_LUT_3_CFG_ID                 0x30044
#define DGC_LUT_3_CFG_LEN                (4U)
#define DGC_LUT_3_CFG_MASK               0xFFFFFFFFUL

/******************************************************************************
* @brief Bit definitions for register DGC_LUT_4_CFG
**/
#define DGC_LUT_4_CFG_ID                 0x30048
#define DGC_LUT_4_CFG_LEN                (4U)
#define DGC_LUT_4_CFG_MASK               0xFFFFFFFFUL

/******************************************************************************
* @brief Bit definitions for register DGC_LUT_5_CFG
**/
#define DGC_LUT_5_CFG_ID                 0x3004c
#define DGC_LUT_5_CFG_LEN                (4U)
#define DGC_LUT_5_CFG_MASK               0xFFFFFFFFUL

/******************************************************************************
* @brief Bit definitions for register DGC_LUT_6_CFG
**/
#define DGC_LUT_6_CFG_ID                 0x30050
#define DGC_LUT_6_CFG_LEN                (4U)
#define DGC_LUT_6_CFG_MASK               0xFFFFFFFFUL

/******************************************************************************
* @brief Bit definitions for register EC_CTRL
**/
#define EC_CTRL_ID                           0x40000
#define EC_CTRL_LEN                          (4U)
#define EC_CTRL_MASK                         0xFFFFFFFFUL
#define EC_CTRL_OSTR_MODE_BIT_OFFSET         (11U)
#define EC_CTRL_OSTR_MODE_BIT_LEN            (1U)
#define EC_CTRL_OSTR_MODE_BIT_MASK           0x800U
#define EC_CTRL_OSTS_WAIT_BIT_OFFSET         (3U)
#define EC_CTRL_OSTS_WAIT_BIT_LEN            (8U)
#define EC_CTRL_OSTS_WAIT_BIT_MASK           0x7f8U

/******************************************************************************
* @brief Bit definitions for register RX_CAL_CFG
**/
#define RX_CAL_CFG_ID                       0x4000c
#define RX_CAL_CFG_LEN                      (4U)
#define RX_CAL_CFG_MASK                     0xFFFFFFFFUL
#define RX_CAL_CFG_COMP_DLY_BIT_OFFSET      (16U)
#define RX_CAL_CFG_COMP_DLY_BIT_LEN         (4U)
#define RX_CAL_CFG_COMP_DLY_BIT_MASK        0xf0000UL
#define RX_CAL_CFG_CAL_EN_BIT_OFFSET        (4U)
#define RX_CAL_CFG_CAL_EN_BIT_LEN           (1U)
#define RX_CAL_CFG_CAL_EN_BIT_MASK          0x10U
#define RX_CAL_CFG_CAL_MODE_BIT_OFFSET      (0U)
#define RX_CAL_CFG_CAL_MODE_BIT_LEN         (2U)
#define RX_CAL_CFG_CAL_MODE_BIT_MASK        0x3U


/******************************************************************************
* @brief Bit definitions for register RX_CAL_RESI
**/
#define RX_CAL_RESI_ID                       0x40014
#define RX_CAL_RESI_LEN                      (4U)
#define RX_CAL_RESI_MASK                     0xFFFFFFFFUL


