GhostBeamFX/makerfabs-dwm3000-esp32-lib/DWM3000/src/dwm3000_regs.h
/******************************************************************************
* @brief Bit definitions for register AON_RDATA
**/
#define AON_RDATA_ID                         0xa0008
#define AON_RDATA_LEN                        (4U)
#define AON_RDATA_MASK                       0xFFFFFFFFUL
#define AON_RDATA_RDATA_BIT_OFFSET           (0U)
#define AON_RDATA_RDATA_BIT_LEN              (8U)
#define AON_RDATA_RDATA_BIT_MASK             0xffU

/******************************************************************************
* @brief Bit definitions for register AON_ADDR
**/
#define AON_ADDR_ID                          0xa000c
#define AON_ADDR_LEN                         (4U)
#define AON_ADDR_MASK                        0xFFFFFFFFUL
#define AON_ADDR_ADDR_BIT_OFFSET             (0U)
#define AON_ADDR_ADDR_BIT_LEN                (9U)
#define AON_ADDR_ADDR_BIT_MASK               0x1ffU

/******************************************************************************
* @brief Bit definitions for register AON_WDATA
**/
#define AON_WDATA_ID                         0xa0010
#define AON_WDATA_LEN                        (4U)
#define AON_WDATA_MASK                       0xFFFFFFFFUL
#define AON_WDATA_WDATA_BIT_OFFSET           (0U)
#define AON_WDATA_WDATA_BIT_LEN              (8U)
#define AON_WDATA_WDATA_BIT_MASK             0xffU

/******************************************************************************
* @brief Bit definitions for register ANA_CFG
**/
#define ANA_CFG_ID                           0xa0014
#define ANA_CFG_LEN                          (4U)
#define ANA_CFG_MASK                         0xFFFFFFFFUL
#define ANA_CFG_PRES_SLEEP_BIT_OFFSET    (5U)
#define ANA_CFG_PRES_SLEEP_BIT_LEN       (1U)
#define ANA_CFG_PRES_SLEEP_BIT_MASK      0x20U
#define ANA_CFG_WAKE_WUP_BIT_OFFSET        (4U)
#define ANA_CFG_WAKE_WUP_BIT_LEN           (1U)
#define ANA_CFG_WAKE_WUP_BIT_MASK          0x10U
#define ANA_CFG_WAKE_CSN_BIT_OFFSET        (3U)
#define ANA_CFG_WAKE_CSN_BIT_LEN           (1U)
#define ANA_CFG_WAKE_CSN_BIT_MASK          0x8U
#define ANA_CFG_BROUT_EN_BIT_OFFSET     (2U)
#define ANA_CFG_BROUT_EN_BIT_LEN        (1U)
#define ANA_CFG_BROUT_EN_BIT_MASK       0x4U
#define ANA_CFG_WAKE_CNT_BIT_OFFSET      (1U)
#define ANA_CFG_WAKE_CNT_BIT_LEN         (1U)
#define ANA_CFG_WAKE_CNT_BIT_MASK        0x2U
#define ANA_CFG_SLEEP_EN_BIT_OFFSET          (0U)
#define ANA_CFG_SLEEP_EN_BIT_LEN             (1U)
#define ANA_CFG_SLEEP_EN_BIT_MASK            0x1U

/******************************************************************************
* @brief Bit definitions for register OTP_WDATA
**/
#define OTP_WDATA_ID                         0xb0000
#define OTP_WDATA_LEN                        (4U)
#define OTP_WDATA_MASK                       0xFFFFFFFFUL
#define OTP_WDATA_OTP_WDATA_BIT_OFFSET       (0U)
#define OTP_WDATA_OTP_WDATA_BIT_LEN          (32U)
#define OTP_WDATA_OTP_WDATA_BIT_MASK         0xffffffffUL

/******************************************************************************
* @brief Bit definitions for register OTP_ADDR
**/
#define OTP_ADDR_ID                          0xb0004
#define OTP_ADDR_LEN                         (4U)
#define OTP_ADDR_MASK                        0xFFFFFFFFUL
#define OTP_ADDR_OTP_ADDR_BIT_OFFSET         (0U)
#define OTP_ADDR_OTP_ADDR_BIT_LEN            (11U)
#define OTP_ADDR_OTP_ADDR_BIT_MASK           0x7ffU

/******************************************************************************
* @brief Bit definitions for register OTP_CFG
**/
#define OTP_CFG_ID                           0xb0008
#define OTP_CFG_LEN                          (4U)
#define OTP_CFG_MASK                         0xFFFFFFFFUL
#define OTP_CFG_DGC_SEL_BIT_OFFSET           (13U)
#define OTP_CFG_DGC_SEL_BIT_LEN              (1U)
#define OTP_CFG_DGC_SEL_BIT_MASK             0x2000U
#define OTP_CFG_OPS_ID_BIT_OFFSET           (11U)
#define OTP_CFG_OPS_ID_BIT_LEN              (2U)
#define OTP_CFG_OPS_ID_BIT_MASK             0x1800U
#define OTP_CFG_OPS_KICK_BIT_OFFSET         (10U)
#define OTP_CFG_OPS_KICK_BIT_LEN            (1U)
#define OTP_CFG_OPS_KICK_BIT_MASK           0x400U
#define OTP_CFG_BIAS_KICK_BIT_OFFSET         (8U)
#define OTP_CFG_BIAS_KICK_BIT_LEN            (1U)
#define OTP_CFG_BIAS_KICK_BIT_MASK           0x100U
#define OTP_CFG_LDO_KICK_BIT_OFFSET          (7U)
#define OTP_CFG_LDO_KICK_BIT_LEN             (1U)
#define OTP_CFG_LDO_KICK_BIT_MASK            0x80U
#define OTP_CFG_DGC_KICK_BIT_OFFSET          (6U)
#define OTP_CFG_DGC_KICK_BIT_LEN             (1U)
#define OTP_CFG_DGC_KICK_BIT_MASK            0x40U
#define OTP_CFG_OTP_WRITE_MR_BIT_OFFSET      (3U)
#define OTP_CFG_OTP_WRITE_MR_BIT_LEN         (1U)
#define OTP_CFG_OTP_WRITE_MR_BIT_MASK        0x8U
#define OTP_CFG_OTP_WRITE_BIT_OFFSET         (2U)
#define OTP_CFG_OTP_WRITE_BIT_LEN            (1U)
#define OTP_CFG_OTP_WRITE_BIT_MASK           0x4U
#define OTP_CFG_OTP_READ_BIT_OFFSET          (1U)
#define OTP_CFG_OTP_READ_BIT_LEN             (1U)
#define OTP_CFG_OTP_READ_BIT_MASK            0x2U
#define OTP_CFG_OTP_MAN_CTR_EN_BIT_OFFSET    (0U)
#define OTP_CFG_OTP_MAN_CTR_EN_BIT_LEN       (1U)
#define OTP_CFG_OTP_MAN_CTR_EN_BIT_MASK      0x1U

/******************************************************************************
* @brief Bit definitions for register OTP_STATUS
**/
#define OTP_STATUS_ID                        0xb000c
#define OTP_STATUS_LEN                       (4U)
#define OTP_STATUS_MASK                      0xFFFFFFFFUL
#define OTP_STATUS_OTP_VPP_OK_BIT_OFFSET     (1U)
#define OTP_STATUS_OTP_VPP_OK_BIT_LEN        (1U)
#define OTP_STATUS_OTP_VPP_OK_BIT_MASK       0x2U
#define OTP_STATUS_OTP_PROG_DONE_BIT_OFFSET  (0U)
#define OTP_STATUS_OTP_PROG_DONE_BIT_LEN     (1U)
#define OTP_STATUS_OTP_PROG_DONE_BIT_MASK    0x1U

/******************************************************************************
* @brief Bit definitions for register OTP_RDATA
**/
#define OTP_RDATA_ID                         0xb0010
#define OTP_RDATA_LEN                        (4U)
#define OTP_RDATA_MASK                       0xFFFFFFFFUL
#define OTP_RDATA_OTP_RDATA_BIT_OFFSET       (0U)
#define OTP_RDATA_OTP_RDATA_BIT_LEN          (32U)
#define OTP_RDATA_OTP_RDATA_BIT_MASK         0xffffffffUL


